# 2 Создайте файл users.txt. Напишите программу которая спрашивает у пользователя
# его Логин и Пароль и записывает в файл users.txt.

# messages = list()
#
# for i in range(1):
#     log = input('введите логин: ')
#     password = input('введите пароль: ')
#     messages.append(log + "\n")
#     messages.append(password)
#
# with open('users.txt', "w") as usrs:
#     for message in messages:
#         usrs.write(message)
#
# print('введенные данные')
# with open('users.txt', "r") as usrs:
#     for message in usrs:
#         print(message, end="")
